zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_USBHS.h
#define USBHS_ID_NID_MASK                        (0x3F00U)
#define USBHS_ID_NID_SHIFT                       (8U)
/*! NID - Complement Version */
#define USBHS_ID_NID(x)                          (((uint32_t)(((uint32_t)(x)) << USBHS_ID_NID_SHIFT)) & USBHS_ID_NID_MASK)

#define USBHS_ID_REVISION_MASK                   (0xFF0000U)
#define USBHS_ID_REVISION_SHIFT                  (16U)
/*! REVISION - Revision Number */
#define USBHS_ID_REVISION(x)                     (((uint32_t)(((uint32_t)(x)) << USBHS_ID_REVISION_SHIFT)) & USBHS_ID_REVISION_MASK)
/*! @} */

/*! @name HWGENERAL - Hardware General */
/*! @{ */

#define USBHS_HWGENERAL_PHYW_MASK                (0x30U)
#define USBHS_HWGENERAL_PHYW_SHIFT               (4U)
/*! PHYW - PHY Width
 *  0b00..8-bit wide data bus (software nonprogrammable)
 *  0b01..16-bit wide data bus (software nonprogrammable)
 *  0b10..Reset to 8-bit wide data bus (software programmable)
 *  0b11..Reset to 16-bit wide data bus (software programmable)
 */
#define USBHS_HWGENERAL_PHYW(x)                  (((uint32_t)(((uint32_t)(x)) << USBHS_HWGENERAL_PHYW_SHIFT)) & USBHS_HWGENERAL_PHYW_MASK)

#define USBHS_HWGENERAL_PHYM_MASK                (0x3C0U)
#define USBHS_HWGENERAL_PHYM_SHIFT               (6U)
/*! PHYM - Transceiver Type
 *  0b0000..UTMI/UMTI+
 *  0b0001..ULPI DDR
 *  0b0010..ULPI
 *  0b0011..Serial only
 *  0b0100..Software programmable: reset to UTMI/UTMI+
 *  0b0101..Software programmable: reset to ULPI DDR
 *  0b0110..Software programmable: reset to ULPI
 *  0b0111..Software programmable: reset to Serial
 *  0b1000..IC-USB
 *  0b1001..Software programmable: reset to IC-USB
 *  0b1010..HSIC
 *  0b1011..Software programmable: reset to HSIC
 *  0b1100-0b1111..Reserved
 */
#define USBHS_HWGENERAL_PHYM(x)                  (((uint32_t)(((uint32_t)(x)) << USBHS_HWGENERAL_PHYM_SHIFT)) & USBHS_HWGENERAL_PHYM_MASK)

#define USBHS_HWGENERAL_SM_MASK                  (0xC00U)
#define USBHS_HWGENERAL_SM_SHIFT                 (10U)
/*! SM - Serial Interface Mode Capability
 *  0b00..No serial engine; always use parallel signaling
 *  0b01..Serial engine present; always use serial signaling for FS and LS
 *  0b10..Software programmable; reset to use parallel signaling for FS and LS
 *  0b11..Software programmable; reset to use serial signaling for FS and LS
 */
#define USBHS_HWGENERAL_SM(x)                    (((uint32_t)(((uint32_t)(x)) << USBHS_HWGENERAL_SM_SHIFT)) & USBHS_HWGENERAL_SM_MASK)

#define USBHS_HWGENERAL_LPM_MASK                 (0x1000U)
#define USBHS_HWGENERAL_LPM_SHIFT                (12U)
/*! LPM - Link Power Management Capability
 *  0b0..Not supported
 *  0b1..Supported
 */
#define USBHS_HWGENERAL_LPM(x)                   (((uint32_t)(((uint32_t)(x)) << USBHS_HWGENERAL_LPM_SHIFT)) & USBHS_HWGENERAL_LPM_MASK)
/*! @} */

/*! @name HWHOST - Host Hardware Parameters */
/*! @{ */

#define USBHS_HWHOST_HC_MASK                     (0x1U)
#define USBHS_HWHOST_HC_SHIFT                    (0U)
/*! HC - Host Capable
 *  0b0..Not supported
 *  0b1..Supported
 */
#define USBHS_HWHOST_HC(x)                       (((uint32_t)(((uint32_t)(x)) << USBHS_HWHOST_HC_SHIFT)) & USBHS_HWHOST_HC_MASK)

#define USBHS_HWHOST_NPORT_MASK                  (0xEU)
#define USBHS_HWHOST_NPORT_SHIFT                 (1U)
/*! NPORT - Number of Ports */
#define USBHS_HWHOST_NPORT(x)                    (((uint32_t)(((uint32_t)(x)) << USBHS_HWHOST_NPORT_SHIFT)) & USBHS_HWHOST_NPORT_MASK)
/*! @} */

/*! @name HWDEVICE - Device Hardware Parameters */
/*! @{ */

#define USBHS_HWDEVICE_DC_MASK                   (0x1U)
#define USBHS_HWDEVICE_DC_SHIFT                  (0U)
/*! DC - Device Capable
 *  0b0..Not supported
 *  0b1..Supported
 */
#define USBHS_HWDEVICE_DC(x)                     (((uint32_t)(((uint32_t)(x)) << USBHS_HWDEVICE_DC_SHIFT)) & USBHS_HWDEVICE_DC_MASK)

#define USBHS_HWDEVICE_DEVEP_MASK                (0x3EU)
#define USBHS_HWDEVICE_DEVEP_SHIFT               (1U)
/*! DEVEP - Device Endpoint Number */
#define USBHS_HWDEVICE_DEVEP(x)                  (((uint32_t)(((uint32_t)(x)) << USBHS_HWDEVICE_DEVEP_SHIFT)) & USBHS_HWDEVICE_DEVEP_MASK)
/*! @} */

/*! @name HWTXBUF - TX Buffer Hardware Parameters */
/*! @{ */

#define USBHS_HWTXBUF_TXBURST_MASK               (0xFFU)
#define USBHS_HWTXBUF_TXBURST_SHIFT              (0U)
/*! TXBURST - TX Burst */
#define USBHS_HWTXBUF_TXBURST(x)                 (((uint32_t)(((uint32_t)(x)) << USBHS_HWTXBUF_TXBURST_SHIFT)) & USBHS_HWTXBUF_TXBURST_MASK)

#define USBHS_HWTXBUF_TXCHANADD_MASK             (0xFF0000U)
#define USBHS_HWTXBUF_TXCHANADD_SHIFT            (16U)
/*! TXCHANADD - TX Channel Add */
#define USBHS_HWTXBUF_TXCHANADD(x)               (((uint32_t)(((uint32_t)(x)) << USBHS_HWTXBUF_TXCHANADD_SHIFT)) & USBHS_HWTXBUF_TXCHANADD_MASK)
/*! @} */

/*! @name HWRXBUF - RX Buffer Hardware Parameters */
/*! @{ */

#define USBHS_HWRXBUF_RXBURST_MASK               (0xFFU)
#define USBHS_HWRXBUF_RXBURST_SHIFT              (0U)
/*! RXBURST - RX Burst */
#define USBHS_HWRXBUF_RXBURST(x)                 (((uint32_t)(((uint32_t)(x)) << USBHS_HWRXBUF_RXBURST_SHIFT)) & USBHS_HWRXBUF_RXBURST_MASK)

#define USBHS_HWRXBUF_RXADD_MASK                 (0xFF00U)
#define USBHS_HWRXBUF_RXADD_SHIFT                (8U)
/*! RXADD - RX Add */
#define USBHS_HWRXBUF_RXADD(x)                   (((uint32_t)(((uint32_t)(x)) << USBHS_HWRXBUF_RXADD_SHIFT)) & USBHS_HWRXBUF_RXADD_MASK)
/*! @} */

/*! @name GPTIMER0LD - General Purpose Timer 0 Load */
/*! @{ */

#define USBHS_GPTIMER0LD_GPTLD_MASK              (0xFFFFFFU)
#define USBHS_GPTIMER0LD_GPTLD_SHIFT             (0U)
/*! GPTLD - General Purpose Timer Load Value */
#define USBHS_GPTIMER0LD_GPTLD(x)                (((uint32_t)(((uint32_t)(x)) << USBHS_GPTIMER0LD_GPTLD_SHIFT)) & USBHS_GPTIMER0LD_GPTLD_MASK)
/*! @} */

/*! @name GPTIMER0CTRL - General Purpose Timer 0 Controller */
/*! @{ */

#define USBHS_GPTIMER0CTRL_GPTCNT_MASK           (0xFFFFFFU)
#define USBHS_GPTIMER0CTRL_GPTCNT_SHIFT          (0U)
/*! GPTCNT - General Purpose Timer Counter */
#define USBHS_GPTIMER0CTRL_GPTCNT(x)             (((uint32_t)(((uint32_t)(x)) << USBHS_GPTIMER0CTRL_GPTCNT_SHIFT)) & USBHS_GPTIMER0CTRL_GPTCNT_MASK)

#define USBHS_GPTIMER0CTRL_GPTMODE_MASK          (0x1000000U)
#define USBHS_GPTIMER0CTRL_GPTMODE_SHIFT         (24U)
/*! GPTMODE - General Purpose Timer Mode
 *  0b0..One Shot mode
 *  0b1..Repeat mode
 */
#define USBHS_GPTIMER0CTRL_GPTMODE(x)            (((uint32_t)(((uint32_t)(x)) << USBHS_GPTIMER0CTRL_GPTMODE_SHIFT)) & USBHS_GPTIMER0CTRL_GPTMODE_MASK)

#define USBHS_GPTIMER0CTRL_GPTRST_MASK           (0x40000000U)
#define USBHS_GPTIMER0CTRL_GPTRST_SHIFT          (30U)
/*! GPTRST - General Purpose Timer Reset
 *  0b0..No action
 *  0b1..Load counter value
 */
#define USBHS_GPTIMER0CTRL_GPTRST(x)             (((uint32_t)(((uint32_t)(x)) << USBHS_GPTIMER0CTRL_GPTRST_SHIFT)) & USBHS_GPTIMER0CTRL_GPTRST_MASK)

