zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_USBHS.h
#define USBHS_USBSTS_SEI_MASK                    (0x10U)
#define USBHS_USBSTS_SEI_SHIFT                   (4U)
/*! SEI - System Error Flag
 *  0b0..Error response did not occur
 *  0b0..No effect
 *  0b1..Clear the flag
 *  0b1..Error response occurred
 */
#define USBHS_USBSTS_SEI(x)                      (((uint32_t)(((uint32_t)(x)) << USBHS_USBSTS_SEI_SHIFT)) & USBHS_USBSTS_SEI_MASK)

#define USBHS_USBSTS_AAI_MASK                    (0x20U)
#define USBHS_USBSTS_AAI_SHIFT                   (5U)
/*! AAI - Interrupt on Asynchronous Advance Flag
 *  0b0..Interrupt did not occur
 *  0b0..No effect
 *  0b1..Clear the flag
 *  0b1..Interrupt occurred
 */
#define USBHS_USBSTS_AAI(x)                      (((uint32_t)(((uint32_t)(x)) << USBHS_USBSTS_AAI_SHIFT)) & USBHS_USBSTS_AAI_MASK)

#define USBHS_USBSTS_URI_MASK                    (0x40U)
#define USBHS_USBSTS_URI_SHIFT                   (6U)
/*! URI - USB Reset Received
 *  0b0..No effect
 *  0b0..USB reset not received
 *  0b1..Clear the flag
 *  0b1..USB reset received
 */
#define USBHS_USBSTS_URI(x)                      (((uint32_t)(((uint32_t)(x)) << USBHS_USBSTS_URI_SHIFT)) & USBHS_USBSTS_URI_MASK)

#define USBHS_USBSTS_SRI_MASK                    (0x80U)
#define USBHS_USBSTS_SRI_SHIFT                   (7U)
/*! SRI - SOF Received Flag
 *  0b0..No effect
 *  0b0..SOF not received
 *  0b1..Clear the flag
 *  0b1..SOF received
 */
#define USBHS_USBSTS_SRI(x)                      (((uint32_t)(((uint32_t)(x)) << USBHS_USBSTS_SRI_SHIFT)) & USBHS_USBSTS_SRI_MASK)

#define USBHS_USBSTS_SLI_MASK                    (0x100U)
#define USBHS_USBSTS_SLI_SHIFT                   (8U)
/*! SLI - Device Controller Suspend Flag
 *  0b0..Did not enter Suspended state
 *  0b0..No effect
 *  0b1..Clear the flag
 *  0b1..Entered Suspended state
 */
#define USBHS_USBSTS_SLI(x)                      (((uint32_t)(((uint32_t)(x)) << USBHS_USBSTS_SLI_SHIFT)) & USBHS_USBSTS_SLI_MASK)

#define USBHS_USBSTS_ULPII_MASK                  (0x400U)
#define USBHS_USBSTS_ULPII_SHIFT                 (10U)
/*! ULPII - ULPI Interrupt Flag
 *  0b0..Event completion did not occur
 *  0b0..No effect
 *  0b1..Clear the flag
 *  0b1..Event completion occurred
 */
#define USBHS_USBSTS_ULPII(x)                    (((uint32_t)(((uint32_t)(x)) << USBHS_USBSTS_ULPII_SHIFT)) & USBHS_USBSTS_ULPII_MASK)

#define USBHS_USBSTS_HCH_MASK                    (0x1000U)
#define USBHS_USBSTS_HCH_SHIFT                   (12U)
/*! HCH - HC Halted */
#define USBHS_USBSTS_HCH(x)                      (((uint32_t)(((uint32_t)(x)) << USBHS_USBSTS_HCH_SHIFT)) & USBHS_USBSTS_HCH_MASK)

#define USBHS_USBSTS_RCL_MASK                    (0x2000U)
#define USBHS_USBSTS_RCL_SHIFT                   (13U)
/*! RCL - Reclamation
 *  0b0..Does not detect
 *  0b1..Detects
 */
#define USBHS_USBSTS_RCL(x)                      (((uint32_t)(((uint32_t)(x)) << USBHS_USBSTS_RCL_SHIFT)) & USBHS_USBSTS_RCL_MASK)

#define USBHS_USBSTS_PS_MASK                     (0x4000U)
#define USBHS_USBSTS_PS_SHIFT                    (14U)
/*! PS - Periodic Schedule Status
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define USBHS_USBSTS_PS(x)                       (((uint32_t)(((uint32_t)(x)) << USBHS_USBSTS_PS_SHIFT)) & USBHS_USBSTS_PS_MASK)

#define USBHS_USBSTS_AS_MASK                     (0x8000U)
#define USBHS_USBSTS_AS_SHIFT                    (15U)
/*! AS - Asynchronous Schedule Status
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define USBHS_USBSTS_AS(x)                       (((uint32_t)(((uint32_t)(x)) << USBHS_USBSTS_AS_SHIFT)) & USBHS_USBSTS_AS_MASK)

#define USBHS_USBSTS_NAKI_MASK                   (0x10000U)
#define USBHS_USBSTS_NAKI_SHIFT                  (16U)
/*! NAKI - NAK Interrupt */
#define USBHS_USBSTS_NAKI(x)                     (((uint32_t)(((uint32_t)(x)) << USBHS_USBSTS_NAKI_SHIFT)) & USBHS_USBSTS_NAKI_MASK)

#define USBHS_USBSTS_UAI_MASK                    (0x40000U)
#define USBHS_USBSTS_UAI_SHIFT                   (18U)
/*! UAI - USB Host Asynchronous Interrupt Flag
 *  0b0..Interrupt did not occur
 *  0b0..No effect
 *  0b1..Clear the flag
 *  0b1..Interrupt occurred
 */
#define USBHS_USBSTS_UAI(x)                      (((uint32_t)(((uint32_t)(x)) << USBHS_USBSTS_UAI_SHIFT)) & USBHS_USBSTS_UAI_MASK)

#define USBHS_USBSTS_UPI_MASK                    (0x80000U)
#define USBHS_USBSTS_UPI_SHIFT                   (19U)
/*! UPI - USB Host Periodic Interrupt Flag
 *  0b0..Interrupt did not occur
 *  0b0..No effect
 *  0b1..Clear the flag
 *  0b1..Interrupt occurred
 */
#define USBHS_USBSTS_UPI(x)                      (((uint32_t)(((uint32_t)(x)) << USBHS_USBSTS_UPI_SHIFT)) & USBHS_USBSTS_UPI_MASK)

#define USBHS_USBSTS_TI0_MASK                    (0x1000000U)
#define USBHS_USBSTS_TI0_SHIFT                   (24U)
/*! TI0 - General Purpose Timer Interrupt 0 (GPTINT0) Flag
 *  0b0..Interrupt did not occur
 *  0b0..No effect
 *  0b1..Clear the flag
 *  0b1..Interrupt occurred
 */
#define USBHS_USBSTS_TI0(x)                      (((uint32_t)(((uint32_t)(x)) << USBHS_USBSTS_TI0_SHIFT)) & USBHS_USBSTS_TI0_MASK)

#define USBHS_USBSTS_TI1_MASK                    (0x2000000U)
#define USBHS_USBSTS_TI1_SHIFT                   (25U)
/*! TI1 - General Purpose Timer Interrupt 1 (GPTINT1) Flag
 *  0b0..Interrupt did not occur
 *  0b0..No effect
 *  0b1..Clear the flag
 *  0b1..Interrupt occurred
 */
#define USBHS_USBSTS_TI1(x)                      (((uint32_t)(((uint32_t)(x)) << USBHS_USBSTS_TI1_SHIFT)) & USBHS_USBSTS_TI1_MASK)

#define USBHS_USBSTS_LPM_L1_EXITI_MASK           (0x10000000U)
#define USBHS_USBSTS_LPM_L1_EXITI_SHIFT          (28U)
/*! LPM_L1_EXITI - L1 Exit Interrupt Flag
 *  0b0..Interrupt did not occur
 *  0b0..No effect
 *  0b1..Clear the flag
 *  0b1..Interrupt occurred
 */
#define USBHS_USBSTS_LPM_L1_EXITI(x)             (((uint32_t)(((uint32_t)(x)) << USBHS_USBSTS_LPM_L1_EXITI_SHIFT)) & USBHS_USBSTS_LPM_L1_EXITI_MASK)

#define USBHS_USBSTS_LPM_L1_ENTRYI_MASK          (0x20000000U)
#define USBHS_USBSTS_LPM_L1_ENTRYI_SHIFT         (29U)
/*! LPM_L1_ENTRYI - L1 Entry Interrupt Flag
 *  0b0..Interrupt did not occur
 *  0b0..No effect
 *  0b1..Clear the flag
 *  0b1..Interrupt occurred
 */
#define USBHS_USBSTS_LPM_L1_ENTRYI(x)            (((uint32_t)(((uint32_t)(x)) << USBHS_USBSTS_LPM_L1_ENTRYI_SHIFT)) & USBHS_USBSTS_LPM_L1_ENTRYI_MASK)

#define USBHS_USBSTS_LPM_DEV_RCVDI_MASK          (0x40000000U)
#define USBHS_USBSTS_LPM_DEV_RCVDI_SHIFT         (30U)
/*! LPM_DEV_RCVDI - Device Received Extension Token Interrupt Flag
 *  0b0..Interrupt did not occur
 *  0b0..No effect
 *  0b1..Clear the flag
 *  0b1..Interrupt occurred
 */
#define USBHS_USBSTS_LPM_DEV_RCVDI(x)            (((uint32_t)(((uint32_t)(x)) << USBHS_USBSTS_LPM_DEV_RCVDI_SHIFT)) & USBHS_USBSTS_LPM_DEV_RCVDI_MASK)

#define USBHS_USBSTS_LPM_HST_COMPI_MASK          (0x80000000U)
#define USBHS_USBSTS_LPM_HST_COMPI_SHIFT         (31U)
/*! LPM_HST_COMPI - Host Completes the LPM Transaction Interrupt Flag
 *  0b0..Interrupt did not occur
 *  0b0..No effect
 *  0b1..Clear the flag
 *  0b1..Interrupt occurred
 */
#define USBHS_USBSTS_LPM_HST_COMPI(x)            (((uint32_t)(((uint32_t)(x)) << USBHS_USBSTS_LPM_HST_COMPI_SHIFT)) & USBHS_USBSTS_LPM_HST_COMPI_MASK)
/*! @} */

/*! @name USBINTR - Interrupt Enable */
/*! @{ */

#define USBHS_USBINTR_UE_MASK                    (0x1U)
#define USBHS_USBINTR_UE_SHIFT                   (0U)
/*! UE - USB Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define USBHS_USBINTR_UE(x)                      (((uint32_t)(((uint32_t)(x)) << USBHS_USBINTR_UE_SHIFT)) & USBHS_USBINTR_UE_MASK)

