zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_USBHS.h
#define USBHS_USBINTR_UEE_MASK                   (0x2U)
#define USBHS_USBINTR_UEE_SHIFT                  (1U)
/*! UEE - USB Error Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define USBHS_USBINTR_UEE(x)                     (((uint32_t)(((uint32_t)(x)) << USBHS_USBINTR_UEE_SHIFT)) & USBHS_USBINTR_UEE_MASK)

#define USBHS_USBINTR_PCE_MASK                   (0x4U)
#define USBHS_USBINTR_PCE_SHIFT                  (2U)
/*! PCE - Port Change Detect Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define USBHS_USBINTR_PCE(x)                     (((uint32_t)(((uint32_t)(x)) << USBHS_USBINTR_PCE_SHIFT)) & USBHS_USBINTR_PCE_MASK)

#define USBHS_USBINTR_FRE_MASK                   (0x8U)
#define USBHS_USBINTR_FRE_SHIFT                  (3U)
/*! FRE - Frame List Rollover Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define USBHS_USBINTR_FRE(x)                     (((uint32_t)(((uint32_t)(x)) << USBHS_USBINTR_FRE_SHIFT)) & USBHS_USBINTR_FRE_MASK)

#define USBHS_USBINTR_SEE_MASK                   (0x10U)
#define USBHS_USBINTR_SEE_SHIFT                  (4U)
/*! SEE - System Error Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define USBHS_USBINTR_SEE(x)                     (((uint32_t)(((uint32_t)(x)) << USBHS_USBINTR_SEE_SHIFT)) & USBHS_USBINTR_SEE_MASK)

#define USBHS_USBINTR_AAE_MASK                   (0x20U)
#define USBHS_USBINTR_AAE_SHIFT                  (5U)
/*! AAE - Asynchronous Advance Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define USBHS_USBINTR_AAE(x)                     (((uint32_t)(((uint32_t)(x)) << USBHS_USBINTR_AAE_SHIFT)) & USBHS_USBINTR_AAE_MASK)

#define USBHS_USBINTR_URE_MASK                   (0x40U)
#define USBHS_USBINTR_URE_SHIFT                  (6U)
/*! URE - USB Reset Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define USBHS_USBINTR_URE(x)                     (((uint32_t)(((uint32_t)(x)) << USBHS_USBINTR_URE_SHIFT)) & USBHS_USBINTR_URE_MASK)

#define USBHS_USBINTR_SRE_MASK                   (0x80U)
#define USBHS_USBINTR_SRE_SHIFT                  (7U)
/*! SRE - SOF Received Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define USBHS_USBINTR_SRE(x)                     (((uint32_t)(((uint32_t)(x)) << USBHS_USBINTR_SRE_SHIFT)) & USBHS_USBINTR_SRE_MASK)

#define USBHS_USBINTR_SLE_MASK                   (0x100U)
#define USBHS_USBINTR_SLE_SHIFT                  (8U)
/*! SLE - Sleep Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define USBHS_USBINTR_SLE(x)                     (((uint32_t)(((uint32_t)(x)) << USBHS_USBINTR_SLE_SHIFT)) & USBHS_USBINTR_SLE_MASK)

#define USBHS_USBINTR_NAKE_MASK                  (0x10000U)
#define USBHS_USBINTR_NAKE_SHIFT                 (16U)
/*! NAKE - NAK Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define USBHS_USBINTR_NAKE(x)                    (((uint32_t)(((uint32_t)(x)) << USBHS_USBINTR_NAKE_SHIFT)) & USBHS_USBINTR_NAKE_MASK)

#define USBHS_USBINTR_UAIE_MASK                  (0x40000U)
#define USBHS_USBINTR_UAIE_SHIFT                 (18U)
/*! UAIE - USB Host Asynchronous Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define USBHS_USBINTR_UAIE(x)                    (((uint32_t)(((uint32_t)(x)) << USBHS_USBINTR_UAIE_SHIFT)) & USBHS_USBINTR_UAIE_MASK)

#define USBHS_USBINTR_UPIE_MASK                  (0x80000U)
#define USBHS_USBINTR_UPIE_SHIFT                 (19U)
/*! UPIE - USB Host Periodic Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define USBHS_USBINTR_UPIE(x)                    (((uint32_t)(((uint32_t)(x)) << USBHS_USBINTR_UPIE_SHIFT)) & USBHS_USBINTR_UPIE_MASK)

#define USBHS_USBINTR_TIE0_MASK                  (0x1000000U)
#define USBHS_USBINTR_TIE0_SHIFT                 (24U)
/*! TIE0 - General Purpose Timer 0 Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define USBHS_USBINTR_TIE0(x)                    (((uint32_t)(((uint32_t)(x)) << USBHS_USBINTR_TIE0_SHIFT)) & USBHS_USBINTR_TIE0_MASK)

#define USBHS_USBINTR_TIE1_MASK                  (0x2000000U)
#define USBHS_USBINTR_TIE1_SHIFT                 (25U)
/*! TIE1 - General Purpose Timer 1 Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define USBHS_USBINTR_TIE1(x)                    (((uint32_t)(((uint32_t)(x)) << USBHS_USBINTR_TIE1_SHIFT)) & USBHS_USBINTR_TIE1_MASK)

#define USBHS_USBINTR_LPM_L1_EXITIE_MASK         (0x10000000U)
#define USBHS_USBINTR_LPM_L1_EXITIE_SHIFT        (28U)
/*! LPM_L1_EXITIE - L1 Exit Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define USBHS_USBINTR_LPM_L1_EXITIE(x)           (((uint32_t)(((uint32_t)(x)) << USBHS_USBINTR_LPM_L1_EXITIE_SHIFT)) & USBHS_USBINTR_LPM_L1_EXITIE_MASK)

#define USBHS_USBINTR_LPM_L1_ENTRYIE_MASK        (0x20000000U)
#define USBHS_USBINTR_LPM_L1_ENTRYIE_SHIFT       (29U)
/*! LPM_L1_ENTRYIE - L1 Entry Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define USBHS_USBINTR_LPM_L1_ENTRYIE(x)          (((uint32_t)(((uint32_t)(x)) << USBHS_USBINTR_LPM_L1_ENTRYIE_SHIFT)) & USBHS_USBINTR_LPM_L1_ENTRYIE_MASK)

#define USBHS_USBINTR_LPM_DEV_RCVDIE_MASK        (0x40000000U)
#define USBHS_USBINTR_LPM_DEV_RCVDIE_SHIFT       (30U)
/*! LPM_DEV_RCVDIE - Device Received Extension Token Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define USBHS_USBINTR_LPM_DEV_RCVDIE(x)          (((uint32_t)(((uint32_t)(x)) << USBHS_USBINTR_LPM_DEV_RCVDIE_SHIFT)) & USBHS_USBINTR_LPM_DEV_RCVDIE_MASK)

#define USBHS_USBINTR_LPM_HST_COMPIE_MASK        (0x80000000U)
#define USBHS_USBINTR_LPM_HST_COMPIE_SHIFT       (31U)
/*! LPM_HST_COMPIE - Host Completed LPM Transaction Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define USBHS_USBINTR_LPM_HST_COMPIE(x)          (((uint32_t)(((uint32_t)(x)) << USBHS_USBINTR_LPM_HST_COMPIE_SHIFT)) & USBHS_USBINTR_LPM_HST_COMPIE_MASK)
/*! @} */

/*! @name FRINDEX - USB Frame Index */
/*! @{ */

#define USBHS_FRINDEX_FRINDEX_MASK               (0x3FFFU)
#define USBHS_FRINDEX_FRINDEX_SHIFT              (0U)
/*! FRINDEX - Frame Index
 *  0b00000000000000..(1024) 12
 *  0b00000000000001..(512) 11
 *  0b00000000000010..(256) 10
 *  0b00000000000011..(128) 9
 *  0b00000000000100..(64) 8
 *  0b00000000000101..(32) 7
 *  0b00000000000110..(16) 6
 *  0b00000000000111..(8) 5
 */
#define USBHS_FRINDEX_FRINDEX(x)                 (((uint32_t)(((uint32_t)(x)) << USBHS_FRINDEX_FRINDEX_SHIFT)) & USBHS_FRINDEX_FRINDEX_MASK)
/*! @} */

/*! @name DEVICEADDR - Device Address */
/*! @{ */

